Revit 2024 API
PreEventArgs Class
 The class is used as a base class for the arguments for any pre-event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class PreEventArgs : RevitEventArgs
Visual Basic
Public Class PreEventArgs _
	Inherits RevitEventArgs
Visual C++
public ref class PreEventArgs : public RevitEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.DB.Events.PreEventArgs
 Autodesk.Revit.DB.Events.PreDocEventArgs
See Also
PreEventArgs Members
Autodesk.Revit.DB.Events Namespace